Revit 2027 API
EnergyAnalysisSurface.Azimuth Property
 The azimuth angle for this surface, in radians.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Azimuth { get; }
Public ReadOnly Property Azimuth As Double
	Get
public:
property double Azimuth {
	double get ();
}
member Azimuth : float with get
Property Value
Double
Remarks
 The azimuth is computed as the angle of rotation between the outward normal of the surface and the Y-axis (clockwise is positive).
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace